# 3장 판다스 시리즈와 데이터프레임 실행하기

- 이번에는 시리즈와 데이터프레임으로 연산자를 실행해보고 간단한 메소드를 처리하는 방법을 익힙니다. 
  - 시리즈와 데이터프레임 공통 메소드 
  - 연산자와 메소드 연산 이해하기 
  - 메소드를 이용한 다양한 처리 알아보기 
  - 누락 값 처리하기 
  - 범주형 데이터 처리하기

In [1]:
import pandas as pd

## 예제 3-1  시리즈와 데이터프레임 내의 동일 메소드 확인

In [11]:
op = pd.read_csv('../data/series_dataframe.csv') 
op.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [12]:
op.shape

(264, 3)

In [13]:
(op['Series'] == op['DataFrame']).head()

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [14]:
op_eq = op.loc[(op['Series'] == op['DataFrame'])]
op_eq.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [15]:
op_eq.shape

(190, 3)

In [16]:
op_eq.tail()

     Member  Series DataFrame
256  update  update    update
259  values  values    values
260     var     var       var
262   where   where     where
263      xs      xs        xs

In [17]:
op_eq_list = op_eq['Member'].tolist()
op_eq_list

['T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_copy',
 'isin',
 'isna',
 'isnull',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'sem',
 'set_axis',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

In [18]:
import types

In [19]:
count = 0 
for i in op_eq_list :     
    try :
        
        if type(pd.Series.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
        if count % 7 == 0 :
            print()
    except Exception as e :
        pass

add,  agg,  aggregate,  align,  all,  any,  append,
apply,  combine,  combine_first,  compound,  corr,  count,  cov,
cummax,  cummin,  cumprod,  cumsum,  diff,  div,  divide,
dot,  drop,  drop_duplicates,  dropna,  duplicated,  eq,  ewm,
expanding,  fillna,  floordiv,  ge,  get_value,  get_values,  gt,
hist,  idxmax,  idxmin,  isin,  isna,  isnull,  keys,
kurt,  kurtosis,  le,  lt,  mad,  max,  mean,
median,  memory_usage,  min,  mod,  mode,  mul,  multiply,
ne,  nlargest,  notna,  notnull,  nsmallest,  pow,  prod,
product,  quantile,  radd,  rdiv,  reindex,  rename,  reorder_levels,
replace,  reset_index,  rfloordiv,  rmod,  rmul,  rolling,  round,
rpow,  rsub,  rtruediv,  sem,  set_value,  shift,  skew,
sort_index,  sort_values,  std,  sub,  subtract,  sum,  swaplevel,
take,  to_csv,  to_dict,  to_period,  to_sparse,  to_string,  to_timestamp,
transform,  truediv,  unstack,  update,  var,

## 예제 3-2  연산자와 메소드 계산

In [21]:
college = pd.read_csv('../data/2017_college_tuition.csv',encoding='euc-kr')
college.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [22]:
college.shape

(196, 3)

In [23]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [24]:
try :
    college + 5
except Exception as e :
    print(e)

can only concatenate str (not "int") to str

In [30]:
college['평균등록금'] = college['평균등록금'] * 1000

In [31]:
college.head()

         학교명 설립구분    평균등록금
0    강릉원주대학교  국공립  4262000
1      강원대학교  국공립  4116000
2  경남과학기술대학교  국공립  3771000
3      경북대학교  국공립  4351000
4      경상대학교  국공립  3967000

In [32]:
(college['평균등록금'] + college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [33]:
college['평균등록금'].add(college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [34]:
help(college['평균등록금'].add)

Help on method add in module pandas.core.ops:

add(other, level=None, fill_value=None, axis=0) method of pandas.core.series.Series instance
    Return Addition of series and other, element-wise (binary operator `add`).

    Equivalent to ``series + other``, but with support to substitute a fill_value for
    missing data in one of the inputs.

    Parameters
    ----------
    other : Series or scalar value
    fill_value : None or float value, default None (NaN)
        Fill existing missing (NaN) values, and any new element needed for
        successful Series alignment, with this value before computation.
        If data in both corresponding Series locations is missing
        the result will be missing.
    level : int or name
        Broadcast across a level, matching Index values on the
        passed MultiIndex level.

    Returns
    -------
    Series
        The result of the operation.

    See Also
    --------
    Series.radd

    Examples
    --------
    >>> a = pd.Series([1, 1, 1, np.nan], index=['a', 'b', 'c', 'd'])
    >>> a
    a    1.0
    b    1.0
    c    1.0
    d    NaN
    dtype: float64
    >>> b = pd.Series([1, np.nan, 1, np.nan], index=['a', 'b', 'd', 'e'])
    >>> b
    a    1.0
    b    NaN
    d    1.0
    e    NaN
    dtype: float64
    >>> a.add(b, fill_value=0)
    a    2.0
    b    1.0
    c    1.0
    d    1.0
    e    NaN
    dtype: float64

## 예제 3-3  특정 자료형을 가지고 열을 구분하기

In [35]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [39]:
college.dtypes.value_counts()   # college.get_dtype_counts() -> college.dtypes.value_counts()

object    2
int64     1
dtype: int64

In [40]:
college.select_dtypes(include=['int64']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

In [41]:
college.select_dtypes(include=['number']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

In [42]:
college.select_dtypes(include=['object']).head()

         학교명 설립구분
0    강릉원주대학교  국공립
1      강원대학교  국공립
2  경남과학기술대학교  국공립
3      경북대학교  국공립
4      경상대학교  국공립

## 예제 3-4 시리즈 내의 자료값 확인하기

In [43]:
college['평균등록금'].value_counts().head()

3424000    2
7161000    2
6803000    1
7535000    1
6904000    1
Name: 평균등록금, dtype: int64

In [44]:
college['평균등록금'].value_counts(normalize=True).head()

3424000    0.010204
7161000    0.010204
6803000    0.005102
7535000    0.005102
6904000    0.005102
Name: 평균등록금, dtype: float64

In [45]:
college['설립구분'].value_counts().head()

사립     156
국공립     40
Name: 설립구분, dtype: int64

In [46]:
college['설립구분'].head()

0    국공립
1    국공립
2    국공립
3    국공립
4    국공립
Name: 설립구분, dtype: object

In [47]:
college['설립구분'].duplicated().head()

0    False
1     True
2     True
3     True
4     True
Name: 설립구분, dtype: bool

In [48]:
college['설립구분'].unique()

array(['국공립', '사립'], dtype=object)

## 예제 3-5 내부 구성 값이 크기 비교

In [49]:
college['평균등록금'].nlargest(5)

173    9004000
132    8824000
128    8649000
147    8526000
146    8499000
Name: 평균등록금, dtype: int64

In [50]:
college['평균등록금'].nsmallest(5)

61           0
157    1760000
137    2000000
20     2390000
15     3024000
Name: 평균등록금, dtype: int64

In [51]:
college.nlargest(5,'평균등록금')

           학교명 설립구분    평균등록금
173  한국산업기술대학교   사립  9004000
132      연세대학교   사립  8824000
128      신한대학교   사립  8649000
147    이화여자대학교   사립  8526000
146      을지대학교   사립  8499000

In [52]:
college.nsmallest(5,'평균등록금')

          학교명 설립구분    평균등록금
61   광주가톨릭대학교   사립        0
157   중앙승가대학교   사립  1760000
137   영산선학대학교   사립  2000000
20    서울시립대학교  국공립  2390000
15    부산교육대학교  국공립  3024000

## 예제 3-6 시리즈만 가지는 메소드

In [54]:
op = pd.read_csv('../data/series_dataframe.csv')
op.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [55]:
op_not = op.loc[(op['Series'] != op['DataFrame'])] 
op_not.head()

      Member    Series DataFrame
12  applymap       NaN  applymap
13    argmax    argmax       NaN
14    argmin    argmin       NaN
15   argsort   argsort       NaN
19  asobject  asobject       NaN

In [56]:
op_not.shape

(74, 3)

In [57]:
op_ser = op_not['Series'].dropna()
op_ser.head()

13      argmax
14      argmin
15     argsort
19    asobject
25    autocorr
Name: Series, dtype: object

In [59]:
op_ser_list = op_ser.tolist()
op_ser_list

['argmax',
 'argmin',
 'argsort',
 'asobject',
 'autocorr',
 'base',
 'between',
 'cat',
 'compress',
 'data',
 'dt',
 'dtype',
 'factorize',
 'flags',
 'from_array',
 'ftype',
 'hasnans',
 'imag',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'item',
 'items',
 'itemsize',
 'iteritems',
 'map',
 'name',
 'nbytes',
 'nonzero',
 'ptp',
 'put',
 'ravel',
 'real',
 'repeat',
 'reshape',
 'searchsorted',
 'str',
 'strides',
 'to_frame',
 'tolist',
 'unique',
 'valid',
 'value_counts',
 'view']

In [60]:
count = 0
for i in op_ser_list :     
    try :
        
        if type(pd.Series.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
            if count % 5 == 0 :
                print()
    except Exception as e :
        pass

argmax,  argmin,  argsort,  autocorr,  between,
compress,  items,  iteritems,  map,  nonzero,
ptp,  put,  ravel,  repeat,  searchsorted,
to_frame,  unique,  valid,  view,

## 예제 3-7 데이터프레임만 가지는 메소드

In [61]:
op_df = op_not['DataFrame'].dropna()

In [62]:
op_df_list = op_df.tolist()

In [63]:
count = 0
for i in op_ser_list :     
    try :
        
        if type(pd.DataFrame.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
            if count % 5 == 0 :
                print()
    except Exception as e :
        pass

items,  iteritems,

In [64]:
import seaborn as sns

In [66]:
iris = sns.load_dataset('iris')   # Seaborn Sample iris(붓꽃 데이터)
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [67]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

## 예제 3-8 인덱스 변경 및 대체

In [69]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [71]:
s_re = s.rename({0:'a',1:'b',2:'c',3:'d'})
s_re

a    1
b    2
c    3
d    4
dtype: int64

In [73]:
s_re.reindex(['a','b','c','e'])

a    1.0
b    2.0
c    3.0
e    NaN
dtype: float64

In [74]:
s_re.reindex(['a','b','c'])

a    1
b    2
c    3
dtype: int64

In [75]:
s_re.reindex(['c','b','a'])

c    3
b    2
a    1
dtype: int64

In [76]:
s_re     # 원형은 바뀌지 않았슴을 주의 !!!

a    1
b    2
c    3
d    4
dtype: int64

In [77]:
s1 = pd.Series([10,20,30], index=[0,1,2]) 
s1

0    10
1    20
2    30
dtype: int64

In [78]:
s1.index.dtype

dtype('int64')

In [80]:
s2 = pd.Series([1,2,3], index=list('012'))
s2

0    1
1    2
2    3
dtype: int64

In [81]:
s2.index.dtype

dtype('O')

In [82]:
s1 + s2

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [83]:
s2.index = [0,1,2]

In [84]:
s1 + s2

0    11
1    22
2    33
dtype: int64

In [86]:
s3 = pd.Series([11,12,13], index=list('012'))
s3

0    11
1    12
2    13
dtype: int64

In [88]:
s3 = s3.rename({'0':0, '1':1,'2':2})
s3

0    11
1    12
2    13
dtype: int64

In [89]:
s1 + s3

0    21
1    32
2    43
dtype: int64

In [90]:
s4 = pd.Series([11,12,13], index=list('012'))

In [91]:
s4.index.values

array(['0', '1', '2'], dtype=object)

In [92]:
s4.index = s4.index.values.astype('int64')

In [93]:
s1 + s4

0    21
1    32
2    43
dtype: int64

## 예제 3-9 특정 열에 대한 정보를 가져오기

In [96]:
flight_route_info = pd.read_csv('../data/flight_route_info.csv',encoding='cp949') 
flight_route_info.head()

,노선명,항공사,출발지,출발국,도착지,도착국,검수,2016.6,2018.5,상태,...,운송량_여름 총합,운송량_2016.9,운송량_2016.10,운송량_2016.11,운송량_2017.9,운송량_2017.10,운송량_2017.11,운송량_2016가을,운송량_2017가을,운송량_가을 총합
0,7J105,Tajik Air,DYU,TJK,IKA,IRI,O,O,O,완료,...,4258,842,985,596,746,597,448,2423,1791,4214
1,7J117,Tajik Air,DYU,TJK,DEL,IND,O,O,O,완료,...,3440,794,815,990,224,0,0,2599,224,2823
2,7J4801,Tajik Air,DYU,TJK,SVX,RUS,O,O,O,완료,...,3949,970,896,596,745,448,448,2462,1641,4103
3,7J4805,Tajik Air,DYU,TJK,SGC,RUS,O,O,O,완료,...,0,0,0,298,0,0,0,298,0,298
4,7J4849,Tajik Air,DYU,TJK,FRU,KGZ,O,O,O,완료,...,3604,767,788,596,298,0,0,2151,298,2449

In [97]:
flight_route_info.columns

Index(['노선명', '항공사', '출발지', '출발국', '도착지', '도착국', '검수', '2016.6', '2018.5',
       '상태', '비고', '운항 횟수', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_겨울 총합', '운항_2017.3', '운항_2017.4',
       '운항_2017.5', '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄',
       '운항_2018봄', '운항_봄 총합', '운항_2016.6', '운항_2016.7', '운항_2016.8',
       '운항_2017.6', '운항_2017.7', '운항_2017.8', '운항_2016여름', '운항_2017여름',
       '운항_여름 총합', '운항_2016.9', '운항_2016.10', '운항_2016.11', '운항_2017.9',
       '운항_2017.10', '운항_2017.11', '운항_2016가을', '운항_2017가을', '운항_가을 총합', '운송량',
       '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12', '운송량_2017.1',
       '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2', '운송량_2016겨울',
       '운송량_2017겨울', '운송량_겨울 총합', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_봄총합', '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6',
       '운송량_2017.7', '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_여름 총합',
       '운송량_2016.9', '운송량_2016.10', '운송량_2016.11', '운송량_2017.9', '운송량_2017.10',
       '운송량_2017.11', '운송량_2016가을', '운송량_2017가을', '운송량_가을 총합'],
      dtype='object')

In [98]:
flight_route_info.filter(like='2016.6').head()

  2016.6  운항_2016.6  운송량_2016.6
0      O          4         692
1      O          4         692
2      O          4         596
3      O          0           0
4      O          5         985

In [99]:
flight_regex = flight_route_info.filter(regex='\d')

In [100]:
flight_regex.columns

Index(['2016.6', '2018.5', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_2017.3', '운항_2017.4', '운항_2017.5',
       '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄', '운항_2018봄',
       '운항_2016.6', '운항_2016.7', '운항_2016.8', '운항_2017.6', '운항_2017.7',
       '운항_2017.8', '운항_2016여름', '운항_2017여름', '운항_2016.9', '운항_2016.10',
       '운항_2016.11', '운항_2017.9', '운항_2017.10', '운항_2017.11', '운항_2016가을',
       '운항_2017가을', '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12',
       '운송량_2017.1', '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2',
       '운송량_2016겨울', '운송량_2017겨울', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6', '운송량_2017.7',
       '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_2016.9', '운송량_2016.10',
       '운송량_2016.11', '운송량_2017.9', '운송량_2017.10', '운송량_2017.11', '운송량_2016가을',
       '운송량_2017가을'],
      dtype='object')

In [101]:
flight_route_info.filter(like='2018').head()

,2018.5,운항_2018,운항_2018.1,운항_2018.2,운항_2018.3,운항_2018.4,운항_2018.5,운항_2018봄,운송량_2018,운송량_2018.1,운송량_2018.2,운송량_2018.3,운송량_2018.4,운송량_2018.5,운송량_2018봄
0,O,22,4,5,5,5,3,13,3578,596,820,970,745,447,2162
1,O,23,5,4,4,6,4,14,4102,895,896,746,969,596,2311
2,O,16,4,2,4,4,2,10,2459,596,298,596,596,373,1565
3,O,9,1,2,2,3,1,6,1341,149,298,298,447,149,894
4,O,9,1,2,2,2,2,6,1416,149,298,373,298,298,969

## 예제 3-10 결측값을 처리하기

In [102]:
import numpy as np

In [103]:
s = pd.Series([0, 1, np.nan, 3])  
s

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [104]:
s.fillna(method='ffill')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [105]:
s.fillna(method='pad')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [106]:
s.fillna(method='bfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [107]:
s.fillna(method='backfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [108]:
flight_route_info.isnull().sum().head(13)

노선명          0
항공사          0
출발지          0
출발국          0
도착지          0
도착국          0
검수           0
2016.6       0
2018.5       0
상태           0
비고         412
운항 횟수        0
운항_2016      0
dtype: int64

In [109]:
s.fillna(method='pad')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [110]:
flight_route_info.isnull().sum().sum()

412

In [111]:
flight_route_info['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2017.10.14. 이후 폐선         2
2017.03.15. 하루 운항         2
Name: 비고, dtype: int64

In [112]:
flight_route_info['비고'].dtype

dtype('O')

In [113]:
flight_route_info.fillna(" ",axis=1, inplace=True)

In [114]:
flight_route_info.isnull().sum().sum()

0

In [115]:
flight_route_info['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.04.23. 이후 폐선         2
2016.10 한 달 운항            2
Name: 비고, dtype: int64

In [116]:
flight_route_info_2 = pd.read_csv('../data/flight_route_info.csv',encoding='cp949')

In [117]:
flight_route_info_2['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2017.10.14. 이후 폐선         2
2017.03.15. 하루 운항         2
Name: 비고, dtype: int64

In [118]:
flight_route_info_3 = flight_route_info_2.select_dtypes(['object']).fillna('')

In [119]:
flight_route_info_3['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2017.10.14. 이후 폐선         2
2017.03.15. 하루 운항         2
Name: 비고, dtype: int64

## 예제 3-11 결측값을 보간처리하기

In [120]:
import numpy as np

In [121]:
s = pd.Series([0, 1, np.nan, 3])

In [122]:
s.interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [124]:
airplane_info = pd.read_csv('../data/airplane_info.csv',encoding='cp949')
airplane_info.head()

     기체번호       항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0  VP-BDK  Aeroflot  A320-214     0    20     0   120  140.0
1  VP-BWD  Aeroflot  A320-214     0    20     0   120  140.0
2  VP-BWE  Aeroflot  A320-214     0    20     0   120  140.0
3  VP-BWF  Aeroflot  A320-214     0    20     0   120  140.0
4  VP-BRZ  Aeroflot  A320-214     0    20     0   120  140.0

In [125]:
airplane_info.isnull().sum()

기체번호     0
항공사      0
기종       0
정원_F     0
정원_C     0
정원_W     0
정원_Y     0
총정원     71
dtype: int64

In [126]:
airplane_info[['기체번호','총정원']].tail()

        기체번호  총정원
2173  VP-BWW  NaN
2174  VP-BRM  NaN
2175  VP-BWZ  NaN
2176  VP-BWX  NaN
2177  VP-BRB  NaN

In [127]:
a = airplane_info['총정원'].interpolate()

In [128]:
a.isnull().sum()

0

In [129]:
a.tail()

2173    180.0
2174    180.0
2175    180.0
2176    180.0
2177    180.0
Name: 총정원, dtype: float64

## 예제 3-12 열 삭제

In [130]:
central_asia_flight_info = pd.read_csv('../data/central_asia_flight_info.csv',encoding='cp949')

In [131]:
central_asia_flight_info.head()

,노선명,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일,Unnamed: 11
0,7J105,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2016,6,5,NaN
1,7J105,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2016,6,12,NaN
2,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,6,19,NaN
3,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,6,26,NaN
4,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,7,3,NaN

In [132]:
central_asia_flight_info.count()

노선명            95015
출발 공항          95015
출발 국가          95015
도착 공항          95015
도착 국가          95015
기체번호           95015
기종             95015
정원(전체)         95015
년도             95015
월              95015
일              95015
Unnamed: 11        0
dtype: int64

In [133]:
central_asia_flight_info.isnull().sum()

노선명                0
출발 공항              0
출발 국가              0
도착 공항              0
도착 국가              0
기체번호               0
기종                 0
정원(전체)             0
년도                 0
월                  0
일                  0
Unnamed: 11    95015
dtype: int64

In [134]:
central = central_asia_flight_info.dropna(axis=1)

In [135]:
central.count()

노선명       95015
출발 공항     95015
출발 국가     95015
도착 공항     95015
도착 국가     95015
기체번호      95015
기종        95015
정원(전체)    95015
년도        95015
월         95015
일         95015
dtype: int64

In [136]:
central_drop = central_asia_flight_info.drop('Unnamed: 11', axis=1)

In [137]:
central_drop.count()

노선명       95015
출발 공항     95015
출발 국가     95015
도착 공항     95015
도착 국가     95015
기체번호      95015
기종        95015
정원(전체)    95015
년도        95015
월         95015
일         95015
dtype: int64

## 예제 3-13 행 삭제

In [138]:
airplane_info = pd.read_csv('../data/airplane_info.csv',encoding='cp949')

In [139]:
airplane_info.count()

기체번호    2178
항공사     2178
기종      2178
정원_F    2178
정원_C    2178
정원_W    2178
정원_Y    2178
총정원     2107
dtype: int64

In [140]:
import numpy as np

In [141]:
np.isnan(np.array([1,2,np.nan]))

array([False, False,  True])

In [142]:
airplane_info['총정원'].apply(np.isnan).tail()

2173    True
2174    True
2175    True
2176    True
2177    True
Name: 총정원, dtype: bool

In [143]:
airplane_info['총정원'].index

RangeIndex(start=0, stop=2178, step=1)

In [144]:
airplane_info['총정원'].index[[2107, 2108]]

Int64Index([2107, 2108], dtype='int64')

In [145]:
index_nan = airplane_info['총정원'].index[airplane_info['총정원'].apply(np.isnan)]

In [146]:
index_nan

Int64Index([2107, 2108, 2109, 2110, 2111, 2112, 2113, 2114, 2115, 2116, 2117,
            2118, 2119, 2120, 2121, 2122, 2123, 2124, 2125, 2126, 2127, 2128,
            2129, 2130, 2131, 2132, 2133, 2134, 2135, 2136, 2137, 2138, 2139,
            2140, 2141, 2142, 2143, 2144, 2145, 2146, 2147, 2148, 2149, 2150,
            2151, 2152, 2153, 2154, 2155, 2156, 2157, 2158, 2159, 2160, 2161,
            2162, 2163, 2164, 2165, 2166, 2167, 2168, 2169, 2170, 2171, 2172,
            2173, 2174, 2175, 2176, 2177],
           dtype='int64')

In [147]:
airplane_info_nan = airplane_info.drop(index=index_nan)

In [148]:
airplane_info_nan.shape

(2107, 8)

In [149]:
airplane_info_nan.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [150]:
airplane_info_dropna = airplane_info.dropna(axis=0)

In [151]:
airplane_info_dropna.shape

(2107, 8)

In [152]:
airplane_info_dropna.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [153]:
ai = airplane_info['총정원']

In [154]:
ai.isnull().sum()

71

In [155]:
ai_d = ai.dropna()

In [156]:
ai_d.isnull().sum()

0

## 예제 3-15 범주형 데이터 생성

In [158]:
s = pd.Series(["a","b","c","a"], dtype="category")
s

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]

In [159]:
s.shape

(4,)

In [160]:
s.values.categories

Index(['a', 'b', 'c'], dtype='object')

In [161]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [162]:
s.dtype

CategoricalDtype(categories=['a', 'b', 'c'], ordered=False)

In [163]:
try : 
    s[2] = 'd'
except Exception as e :
    print(e)

Cannot setitem on a Categorical with a new category, set the categories first

In [164]:
s[2] = 'b'

In [165]:
try : 
    s[4] = 'c'
except Exception as e :
    print(e)

In [166]:
s.loc[4] ='c'

In [167]:
s

0    a
1    b
2    b
3    a
4    c
dtype: object

## 예제 3-16 범주형 데이터 클래스 이해하기

In [168]:
cat = pd.Categorical(['a','b','c'])

In [169]:
type(cat)

pandas.core.arrays.categorical.Categorical

In [170]:
c = set(dir(cat))

In [171]:
ss = set(dir(pd.Series))

In [172]:
c_d =  c - ss

In [173]:
count = 0 
for i in c_d :
    if not i.startswith("_") :
        count += 1
        print(i, end=", ")
        if count % 5 == 0 :
            print()

add_categories, set_categories, rename_categories, take_nd, from_codes,
categories, as_unordered, ordered, set_ordered, remove_categories,
codes, check_for_ordered, is_dtype_equal, as_ordered, remove_unused_categories,
reorder_categories,

In [174]:
cat.categories

Index(['a', 'b', 'c'], dtype='object')

In [175]:
cat.dtype

CategoricalDtype(categories=['a', 'b', 'c'], ordered=False)

In [176]:
s1 = pd.Series(["a","b","c","a"], dtype=cat.dtype)

In [177]:
s1

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]

## 예제 3-17 데이터프레임에서 범주형 자료형 처리

In [178]:
import numpy as np

In [179]:
cat_1 = pd.Categorical(["a", "c", "c", np.nan], categories=["b", "a", "c"])

In [180]:
cat_1.dtype

CategoricalDtype(categories=['b', 'a', 'c'], ordered=False)

In [181]:
df = pd.DataFrame({"cat":cat_1, "s":["a", "c", "c", np.nan]})

In [182]:
df

   cat    s
0    a    a
1    c    c
2    c    c
3  NaN  NaN

In [183]:
df.select_dtypes(exclude=['object'])

   cat
0    a
1    c
2    c
3  NaN

In [185]:
df['cat'][3] = 'b'
df

  cat    s
0   a    a
1   c    c
2   c    c
3   b  NaN

In [186]:
df.loc[4,:] = ['a','a']

In [187]:
df

  cat    s
0   a    a
1   c    c
2   c    c
3   b  NaN
4   a    a

## 예제 3-18 파일을 읽어서 범주형 자료형으로 변경처리

In [188]:
airplane = pd.read_csv('../data/airplane_info.csv',encoding='cp949') 
airplane.head()

     기체번호       항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0  VP-BDK  Aeroflot  A320-214     0    20     0   120  140.0
1  VP-BWD  Aeroflot  A320-214     0    20     0   120  140.0
2  VP-BWE  Aeroflot  A320-214     0    20     0   120  140.0
3  VP-BWF  Aeroflot  A320-214     0    20     0   120  140.0
4  VP-BRZ  Aeroflot  A320-214     0    20     0   120  140.0

In [189]:
airplane['항공사'].dtype

dtype('O')

In [190]:
air_cat = pd.Categorical(airplane['항공사'])

In [191]:
air_cat.categories

Index(['AZAL Azerbaijan Airlines', 'Aeroflot', 'Air Arabia', 'Air Astana',
       'Air Baltic', 'Air China', 'Air Kyrgyzstan', 'Air Manas',
       'Airzena Georgian Airways', 'Asiana Airlines', 'AtlasGlobal',
       'Avia Traffic Company', 'Belavia', 'China Southern Airlines',
       'Ellinair', 'Etihad Airways', 'Finnair', 'Globus Airlines',
       'Hainan Airlines', 'Iran Aseman Airlines', 'KLM Royal Dutch Airlines',
       'Kam Air', 'Korean Air', 'LOT - Polish Airlines', 'Lufthansa',
       'MIAT - Monglian Airlines', 'Mahan Air', 'NordStar', 'Pegas Fly',
       'Pegasus Airlines', 'Pobeda', 'Red Wings', 'Rusline', 'S7 Airlines',
       'SCAT', 'Somon Air', 'Sunday Airlines', 'Tajik Air', 'Turkish Airlines',
       'Turkmenistan Airlines', 'Ukraine International Airlines',
       'Ural Airlines', 'Urumqi Air', 'Utair', 'Uzbekistan Airways',
       'VIM Airlines', 'Wizz Air', 'Yakutia Airlines', 'Yamal Airlines',
       'flydubai'],
      dtype='object')

In [192]:
air_cat

[Aeroflot, Aeroflot, Aeroflot, Aeroflot, Aeroflot, ..., Red Wings, Red Wings, Red Wings, Red Wings, Red Wings]
Length: 2178
Categories (50, object): [AZAL Azerbaijan Airlines, Aeroflot, Air Arabia, Air Astana, ..., Wizz Air, Yakutia Airlines, Yamal Airlines, flydubai]

In [193]:
air_cat.shape

(2178,)

In [196]:
airplane['항공사'].dtype

dtype('O')

In [199]:
airplane['항공사'] = airplane['항공사'].astype(air_cat)

AttributeError: 'Categorical' object has no attribute '_ordered'

In [200]:
airplane['항공사'].dtype

dtype('O')

In [202]:
try :
    airplane['항공사'][0] = "Asia Airline"
except Exception as e :
    print(e)

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [203]:
airplane.isnull().sum()

기체번호     0
항공사      0
기종       0
정원_F     0
정원_C     0
정원_W     0
정원_Y     0
총정원     71
dtype: int64

In [204]:
airplane.columns

Index(['기체번호', '항공사', '기종', '정원_F', '정원_C', '정원_W', '정원_Y', '총정원'], dtype='object')

In [205]:
airplane['총정원'].isnull().sum()

71

In [208]:
airplane.loc[airplane['총정원'].isnull(), '총정원']  =   \
     airplane.loc[airplane['총정원'].isnull(), '정원_Y']

In [209]:
airplane.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [210]:
airplane['총정원'].between(1,120).sum()

235

In [211]:
mask = airplane['총정원'].between(1,120)

In [212]:
import numpy as np

In [213]:
airplane['category_R'] = ""

In [214]:
airplane['category_R']  = pd.Categorical(np.where(mask, '소형', '중형'))

In [215]:
airplane.head()

     기체번호           항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원 category_R
0  VP-BDK  Asia Airline  A320-214     0    20     0   120  140.0         중형
1  VP-BWD      Aeroflot  A320-214     0    20     0   120  140.0         중형
2  VP-BWE      Aeroflot  A320-214     0    20     0   120  140.0         중형
3  VP-BWF      Aeroflot  A320-214     0    20     0   120  140.0         중형
4  VP-BRZ      Aeroflot  A320-214     0    20     0   120  140.0         중형

In [216]:
airplane['category_R'].value_counts()

중형    1943
소형     235
Name: category_R, dtype: int64

In [217]:
airplane['category_R'].dtype

CategoricalDtype(categories=['소형', '중형'], ordered=False)

In [218]:
np.zeros(10000*10000)

array([0., 0., 0., ..., 0., 0., 0.])